<a href="https://colab.research.google.com/github/mnshtxp/ds-admission-challenge/blob/master/ds_bootcamp_admission_challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Challenge

- 코드스테이츠 DS 부트캠프 어드미션을 위한 Challenge 과제 입니다. 
- 아래 challenge 를 풀기 위해 제공된 강의가 모든 것을 알려주진 않습니다. 
- 따라서 필요한 부분은 스스로 google 검색을 통해 이 challenge 를 완성해 주셔야 합니다. 
- 각 shell 에 필요한 부분을 작성하신 후 함께 링크를 제출해 주시면 됩니다.
- 모든 결과물은 하나의 shell에서 모두 실행될 수 있도록 print문을 사용해 주세요. run all 했을 때 전체 shell 이 모두 잘 실행될 수 있도록 관리해 주세요.

In [ ]:
# 1. 다음의 list 에서 두 번째 list elemnet 를 print 해 보세요
list_01 = ['Paul', 'John', 'Ringo', 'George']
# 두 번째 John을 출력하려면 순서를 지정하는데 파이썬에서 인덱스는 0부터 시작하므로 1번을 입력해서 출력한다.
print(list_01[1])

John

In [ ]:
# 2. 다음의 list in the list에서 두 번째 element 를 print 해 보세요
list_02 = [['Paul', 'John', 'Ringo', 'George'],['A','B','1',2]]

# 리스트안에 리스트에서 두 번째 요소를 출력하기 위해서 리스트 인덱스를 먼저 써준다.
# 마찬가지로 인덱스는 0번부터 시작하고 John은 첫 리스트에 있으므로 리스트 인덱스인 0을 먼저 사용하고 두 번째에 위치하기 때문에 1을 사용해서 출력한다.
print(list_02[0][1])
print(list_02[1][3])

John
2

In [ ]:
# Initializing list  
list_01 = [ 1, 6, 3, 5, 3, 4 ] 
list_02 = [ 1, 6, 3, 5, 3 ] 

# for loop을 이용하여 두 개의 리스트 안에 4가 있는지 없는지 print 하는 코드를 작성하세요
# 반복문을 사용해서 리스트 안에 특정 숫자가 있으면 있다, 없으면 없다고 출력하는 코드를 만드는데
# 먼저 for문을 사용해야하므로 리스트 안에 인자가 들어가는 걸 표시하고
# if문을 활용해서 해당 리스트 안에 4가 있다면 있다고 출력하고, for문은 인자 하나씩 돌아가면서 반복이 되기 때문에 바로 break를 걸어 멈춰준다.
# else도 마찬가지로 print를 하고나면 break로 멈춰준다. 
for i in list_01 :
  if 4 in list_01 : 
    print('4가 있어요')
    break
  else :
    print('4가 없어요')
    break

for i in list_02 :
  if 4 in list_02 : 
    print('4가 있어요')
    break
  else :
    print('4가 없어요')
    break

4가 있어요
4가 없어요

In [ ]:
# if문 만으로도 위에서 원하는 값을 출력할 수 있다.

if 4 in list_01 :
  print('안에 4있다.')
else :
  print ('안에 4 없다')

if 4 in list_02 :
  print('안에 4있다.')
else :
  print ('안에 4 없다.')

안에 4있다.
안에 4 없다.

In [ ]:
# 위 코드 역할을 하는 함수를 작성해 보세요.
# 사용자 정의 함수를 만들기 위해 def를 사용하고 함수명인 four와 안에 들어갈 변수도 표시해준다.
# 위에 사용했던 for문을 활용해서 작성했다.
def four(x) :
  for i in x :
    if 4 in x : 
      print('4가 있어요')
      break
    else :
      print('4가 없어요')
      break
four(list_01)
four(list_02)

4가 있어요
4가 없어요

In [ ]:
list_03 = [4, 5, 8, 9, 10] 
# 위 list element 중 8보다 큰 숫자가 몇 개가 있는지 코드로 작성해 보세요.
# 리스트 안에 인자가 있는지 for문을 사용하고 이 때 인자가 8보다 크다는 조건을 걸고
# 그 개수를 더해서 출력할 수있도록 sum을 사용했다. 
sum(i > 8 for i in list_03)

2

In [ ]:
# BMI
height = [1.87,  1.87, 1.82, 1.91, 1.90, 1.85]
weight = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

# bmi = weight / height ** 2 를 numpy array 활용하여 구해보세요
# bmi 가 24 이상인 값들만 선택해 보세요

# numpy array를 사용하기 위해 numpy를 import한다.
# array로 변경한 걸 새로운 변수에 담아준다.

import numpy as np
np_h = np.array(height)
np_w = np.array(weight)
bmi = np_w / np_h **2
print(bmi)
print(bmi[bmi>=24])

[23.34925219 27.88755755 28.75558507 25.48723993 23.87257618 25.84368152]
[27.88755755 28.75558507 25.48723993 25.84368152]

In [ ]:
# pandas 패키지 라이브러리를 불러오세요
# 데이터 프레임 기능이 있는 pandas를 사용하기 위해 import 한다.
import pandas as pd
# 아래 내용을 담는 pandas Dataframe 을 생성하세요
# {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}
# 데이터프레임에 컬럼명을 ''안에 넣고 내용은 :으로 연결해서 괄호 안에 데이터를 넣어준다. 여러개 컬럼을 한 번에 만들 때 중괄호로 묶어서 한 번에 만들 수 있다.
pd.DataFrame(
    {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}
)

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [16]:
# 아래와 같은 dataframe을 만들어 보세요. (참고: 연도가 index가 되게 해 주세요)
"""
year dept     revenue
2015 Sales    30
2016 Sales    35
2017 Sales    40
"""

# 데이터 프레임만드는 코드를 단순화 하기 위해 data 변수에 데이터를 담아준다.
# 데이터 프레임을 만들고 year를 인덱스 이름으로 지정하기 위해 set_index를 사용한다.

data = {'year' : [2015, 2016, 2017],
        'dept' : ['Sales', 'Sales', 'Sales'],
        'revenue' : [30, 35, 40]}
df = pd.DataFrame(data).set_index('year')
print(df)

# 2017년 데이터만 선택해 보세요
# 2017년 row만 선택해서 보기 위해 그리고 조건이 2017이라 loc를 사용해서 print합니다.
# index 번호로 찾을 때는 세번째줄이라 iloc[2]를 활용하거나 마지막 row라서 -1을 써서 쓸 수도 있습니다.
# 모든 코드 출력값을 보기 위해서 print문을 썼습니다.
print(df.loc[2017])
print(df.iloc[2])
print(df.iloc[-1])
# 조건(condition)을 활용하여 revenue 30 이상으로만 filter 해 보세요. reference: https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/03_subset_data.html 
# 30 이상은 모두 나오기 때문에 초과로 변경해서 코딩했습니다.
# revenue를 선택할 때 대괄호를 사용하거나 .을 사용해도 같은 값이 나오기 때문에 둘 다 사용했습니다.
print(df[df['revenue']>30])
print(df[df.revenue>30])

       dept  revenue
year
2015  Sales       30
2016  Sales       35
2017  Sales       40
dept       Sales
revenue       40
Name: 2017, dtype: object
dept       Sales
revenue       40
Name: 2017, dtype: object
dept       Sales
revenue       40
Name: 2017, dtype: object
       dept  revenue
year
2016  Sales       35
2017  Sales       40
       dept  revenue
year
2016  Sales       35
2017  Sales       40

In [ ]:
# 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv' 자료를 불러와 dataframe으로 만들어 보세요 
# csv를 불러 오기 위해서 pd.read_csv를 사용하고 ti라는 변수에 담아준다.
# 일부 데이터를 확인하기 위해 head()를 사용한다. 괄호 안에 따로 개수를 지정하지 않으면 기본 값으로 5줄까지 나타난다.
ti = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
ti.head()

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]

In [ ]:
# 타이타닉 데이터의 shape은 어떻게 되나요? 
# 데이터프레임의 row와 column개수를 확인할 수 있는 shape를 사용해서 shape를 구한다. 아래 값을 한 번에 보기 위해 print()로 묶어주었다.
print(ti.shape)


# 타이타닉 row record에서 10~20번째 줄을 출력해 보세요
# 숫자로 지정해서 특정 row를 나타내기 위해 iloc를 사용했다.
print(ti.iloc[10:21])


# 타이타닉 데이터에서 'Survived', 'Age', 'Sex' 칼럼 데이터를 선택해 보세요
# 특정 컬럼을 보기 위해서 데이터 프레임 ti를 쓰고 보고자 하는 컬럼이 리스트이기에 대괄호를 쓴다. 보고자 하는 컬럼이 3개, 즉 리스트가 2개 이상이기에 겹괄호를 사용한다.
print(ti[['Survived', 'Age', 'Sex']])


# 타이타닉 데이터에서 생존자 데이터만 골라보세요
# 생존자를 보려면 Survived컬럼을 봐야한다. 위와 마찬가지로 리스트이기에 데이터프레임 변수명과 대괄호를 사용해서 Survived컬럼을 선택한다.
# Survived에서 사망자와 생존자 구분을 0과 1로 하기에 해당 컬럼에 1이 있는 값만 선택하기 위해서 ==1로 표시했다. 파이썬에서 equal은 ==으로 사용한다.
# ti['Survived']==1로만 하면 해당 컬럼에서 1값이 있는지 없는지 True와 False로만 나오기 때문에 대괄호를 씌우고 앞에 데이터 프레임명을 한 번 더 씀으로
# 생존자의 데이터만 표시해준다.
# 값을 survived에 담아준다.
survived = ti[ti['Survived']==1]
print(survived)


# 생존자 데이터 중 여자, 남자 중 누가 더 많나요? 참고: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html
# value_counts()는 특정 컬럼 안에 유니크한 값과 총 개수가 얼마인지 알려준다. 
# 이를 사용해서 생존자 데이터내에 성별 컬럼에서 value_counts를 구해준다.
survived['Sex'].value_counts()

(887, 8)
    Survived  Pclass  ... Parents/Children Aboard     Fare
10         1       3  ...                       1  16.7000
11         1       1  ...                       0  26.5500
12         0       3  ...                       0   8.0500
13         0       3  ...                       5  31.2750
14         0       3  ...                       0   7.8542
15         1       2  ...                       0  16.0000
16         0       3  ...                       1  29.1250
17         1       2  ...                       0  13.0000
18         0       3  ...                       0  18.0000
19         1       3  ...                       0   7.2250
20         0       2  ...                       0  26.0000

[11 rows x 8 columns]
     Survived   Age     Sex
0           0  22.0    male
1           1  38.0  female
2           1  26.0  female
3           1  35.0  female
4           0  35.0    male
..        ...   ...     ...
882         0  27.0    male
883         1  19.0  female
884         0   7.0  female
885         1  26.0    male
886         0  32.0    male

[887 rows x 3 columns]
     Survived  Pclass  ... Parents/Children Aboard     Fare
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
8           1       3  ...                       2  11.1333
9           1       2  ...                       0  30.0708
..        ...     ...  ...                     ...      ...
871         1       3  ...                       0   7.2250
875         1       1  ...                       1  83.1583
876         1       2  ...                       1  26.0000
883         1       1  ...                       0  30.0000
885         1       1  ...                       0  30.0000

[342 rows x 8 columns]

female    233
male      109
Name: Sex, dtype: int64